#pragma once
// об€з.
// перенести класс передвижени€, сохранив анимацию из спрайтов +
// добавить миссию +
// добавить телепортацию +
// больше текстур +
// взаимодействие с объектом (шар?)  + 
// добавить взаимодействие с сундуком +
// ќѕ“»ћ»«»–ќ¬ј“№  ќƒ
// по возможности:
// добавить взаимодействие с скелетом + 
// исправить коллизию со скелетом +
// доделать концовки игры -
// необ€з:
// добавить еще один вид ловушки - 
// сделать два вида карты  - 
// меню игры ? 
// скорость*врем€ = рассто€ние (смещение спрайта)